//Задача 25: Напишите цикл, который принимает на вход два числа (A и B) 
//и возводит число A в натуральную степень B.
//3, 5 -> 243 (3⁵)
//2, 4 -> 16

//Console.Write("введите число: ");
//int number1 = int.Parse(Console.ReadLine());
//Console.Write("введите степень числа: ");
//int number2 = int.Parse(Console.ReadLine());
//double pow = Math.Pow(number1,number2);
//Console.Write(pow);

//Задача 27: Напишите программу, которая принимает 
//на вход число и выдаёт сумму цифр в числе.
//452 -> 11
//82 -> 10
//9012 -> 12

//int WorkU(String msg)
//{
//    System.Console.WriteLine("Введите число: ");
//    string mass = System.Console.ReadLine();
//    int number=int.Parse(mass);
//    return number;
//}
//int Summ(int num)
//{
//    int number = 0;
//    while(num>0)
//    {
//        number += num %10;
//        num = num/10;
//    }
//    return number;
//}
//int num = WorkU("Введите число: ");
//System.Console.WriteLine($"Сумма всех чисел {num} = {Summ(num)}"

//Задача 29: Напишите программу, которая задаёт массив 
//из 8 элементов и выводит их на экран.

//int[] numbers = new int[8];
//FillArray(numbers);
//PrintArray(numbers);
//void FillArray (int[] array)
//{
//    for(int i=0;i<array.Length; i++)
//    {
//        array[i]=new Random().Next(0,9);
//    }
//}
//void PrintArray(int[] Collection)
//{
//    for (int i=0;i<Collection.Length;i++)
//    {
//        Console.Write(Collection[i]+ " ");
//    }
//}


